tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/1.Initialization/counterFlowSimpleMechanism/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingDNS;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         1.0;

deltaT          1e-6;

writeControl   adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.4;

functions
{
    #includeFunc Qdot

    sampleSets
    {
        type sets;

        libs            ("libsampling.so");

        interpolationScheme cell;

        setFormat       csv;

        writeControl    writeTime;

        sets
        (
            data
            {
                type    lineUniform;
                axis    x;
                start   (0 0 0);
                end     (0.02 0 0);
                nPoints 1001;
            }
        );

        fields          (NH3 C7H16 O2 N2 p T);
    }
}


// ************************************************************************* //
