tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/1.Initialization/counterFlowSimpleMechanism/constant/reactions
reactions
{
}
Tlow            100;
Thigh           6000;

