tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/1.Initialization/counterFlowSimpleMechanism/constant/thermo.compressibleGas
species         4 ( O2 N2 NH3 C7H16 );

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.95257637 0.0013969004 -4.92631603e-07 7.86010195e-11 -4.60755204e-15 -923.948688 5.87188762 );
        lowCpCoeffs     ( 3.53100528 -0.000123660988 -5.02999433e-07 2.43530612e-09 -1.40881235e-12 -1046.97628 2.96747038 );
    }
    transport
    {
        As              1.63e-06;
        Ts              176.3426;
    }
    elements
    {
        N               2;
    }
}

CO2
{
    specie
    {
        molWeight       44.00995;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.6365111 0.0027414569 -9.9589759e-07 1.6038666e-10 -9.1619857e-15 -49024.904 -1.9348955 );
        lowCpCoeffs     ( 2.356813 0.0089841299 -7.1220632e-06 2.4573008e-09 -1.4288548e-13 -48371.971 9.9009035 );
    }
    transport
    {
        As              1.71e-06;
        Ts              300.5352;
    }
    elements
    {
        O               2;
        C               1;
    }
}

NH3
{
    specie
    {
        molWeight       17.03061;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 2.17000818 0.00676363558 -2.64200998e-06 5.26178719e-10 -4.21542607e-14 -6356.33825 9.0352609 );
        lowCpCoeffs     ( 3.58776922 0.00109259142 5.86455626e-06 -5.14486544e-09 1.37560678e-12 -6639.89046 2.19538342 );
    }
    transport
    {
        As              1.77e-06;
        Ts              551.6036;
    }
    elements
    {
        H               3;
        N               1;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.66096065 0.000656365811 -1.41149627e-07 2.05797935e-11 -1.29913436e-15 -1215.97718 3.41536279 );
        lowCpCoeffs     ( 3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573 );
    }
    transport
    {
        As              1.82e-06;
        Ts              172.1024;
    }
    elements
    {
        O               2;
    }
}

CH4
{
    specie
    {
        molWeight       16.04303;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 1.65326226 0.0100263099 -3.31661238e-06 5.36483138e-10 -3.14696758e-14 -10009.5936 9.90506283 );
        lowCpCoeffs     ( 5.14911468 -0.0136622009 4.91453921e-05 -4.84246767e-08 1.66603441e-11 -10246.5983 -4.63848842 );
    }
    transport
    {
        As              1.14e-06;
        Ts              205.0919;
    }
    elements
    {
        H               4;
        C               1;
    }
}

C7H16
{
    specie
    {
        molWeight       100.20557;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.95257637 0.0013969004 -4.92631603e-07 7.86010195e-11 -4.60755204e-15 -923.948688 5.87188762 );
        lowCpCoeffs     ( 3.53100528 -0.000123660988 -5.02999433e-07 2.43530612e-09 -1.40881235e-12 -1046.97628 2.96747038 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               7;
        H               16;
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.6770389 0.0029731816 -7.7376889e-07 9.4433514e-11 -4.2689991e-15 -29885.894 6.88255 );
        lowCpCoeffs     ( 4.1986352 -0.0020364017 6.5203416e-06 -5.4879269e-09 1.771968e-12 -30293.726 -0.84900901 );
    }
    transport
    {
        As              2.05e-06;
        Ts              803.1952;
    }
    elements
    {
        H               2;
        O               1;
    }
}
