tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/1.Initialization/counterFlowSimpleMechanism/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.234;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    air
    {
        type            fixedValue;
        value           uniform 0.2226;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.234;
        value           uniform 0.234;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
