tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/1.Initialization/counterFlowSimpleMechanism/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`
runApplication blockMesh
runApplication $application
